/**
 ******************************************************************************
 * @file           : tsk_imu.cpp
 * @brief          : IMU任务
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 GMaster
 * All rights reserved.
 *
 ******************************************************************************
 */
/* Includes ------------------------------------------------------------------*/
#include "crt_gimbal.hpp"

/* Typedef -------------------------------------------------------------------*/

/* Define --------------------------------------------------------------------*/

/* Macro ---------------------------------------------------------------------*/

/* Variables -----------------------------------------------------------------*/
extern Gimbal gimbal;
extern BMI088 imu;
// extern IMU imu;

/* Function prototypes -------------------------------------------------------*/

/* User code -----------------------------------------------------------------*/




extern "C" void imu_task(void *argument)
{
    TickType_t taskLastWakeTime = xTaskGetTickCount(); // 获取任务开始时间
    imu.init();
    while (1) {
        gimbal.imuGetYawAngleLoop();
        vTaskDelayUntil(&taskLastWakeTime,10); // 确保任务以定周期1ms运行
    }
}
